---
kind: method
id: M:Autodesk.Revit.DB.IFC.RoofComponents.GetLoopFaces
source: html/22f14572-2816-43d4-3bc9-8d038ff340df.htm
---
# Autodesk.Revit.DB.IFC.RoofComponents.GetLoopFaces Method

The faces of the loops of roof slabs.

## Syntax (C#)
```csharp
public IList<Face> GetLoopFaces()
```

## Returns
The faces.